Repository: lovelace-dev-org/lovelace
Catalog: webapp/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Enrollments to this course are accepted automatically
fi: Tämän kurssin ilmoittautumiset hyväksytään automaattisesti

source: Send application
fi: Lähetä ilmoittautuminen

source: Please log in to view your information.
fi: Kirjaudu sisään nähdäksesi tietosi.

source: You are only allowed to view your own information.
fi: Voit katsoa vain omia tietojasi.

source: This course instance doesn't allow groups
fi: Tämä kurssi-instanssi ei salli ryhmiä

source: Write the usernames of users you want to invite
fi: Kirjoita kutsuttavien käyttäjien käyttäjätunnukset

source: Can't invite users to groups you're not a member of
fi: Et voi kutsua käyttäjiä ryhmään jos et ole sen jäsen

source: Can't accept invitation, already a member of another group
fi: Et voi hyväksyä kutsua, koska kuulut jo ryhmään

source: Can't manage invitations for groups you're not a member of
fi: Et voi hallinnoida ryhmän kutsuja jos et ole sen jäsen

source: Content {content} is not linked to course {course}!
fi: Sisältöä {content} ei ole liitetty kurssin {course}!

source: This content is (currently) only available to course staff
fi: Tämä sisältö on rajattu (tällä hetkellä) kurssin henkilökunnalle.

source: This content is only available to enrolled users
fi: Tämä sisältö näkyy vain ilmoittautuneille

source: The task was not linked on the requested course instance
fi: Tehtävää ei ole yhdistetty tähän kurssitilaan.

source: You don't have any more attempts left for this task.
fi: Sinulla ei ole yrityksiä jäljellä tähän tehtävään.

source: Error, exercise backend unavailable.
fi: Virhe: tarkistusprosessi ei ole päällä.

source: The program took too long to execute and was terminated. Check your code for too slow solutions.
fi: Ohjelman suoritus kesti liian kauan ja se lopetettiin kesken. Tarkista koodisi ja korjaa mahdolliset hitaat ratkaisut

source: Checking program was unable to finish due to an error. Contact course staff.
fi: Tarkistinohjelma kaatui kesken tarkistuksen. Ota yhteyttä kurssin henkilökuntaan.

source: You cannot access this answer.
fi: Et voi ladata tätä vastausta.

source: No such file {mediafile}
fi: Tiedostoa {mediafile} ei ole

source: Requested file does not exist.
fi: Tiedostoa ei löytynyt

source: Only course main responsible teachers are allowed to download media files through this interface.
fi: Vain kurssien vastuuhenkilöt voivat ladata vastaustiedostot.

source: This exercise does't exist
fi: Tehtävää ei löytynyt

source: Only course main responsible teachers are allowed to download files through this interface.
fi: Vain kurssien vastuuhenkilöt voivat ladata tiedostoja tätä kautta.

source: Only logged in users can enroll to courses.
fi: Vain sisäänkirjautuneet käyttäjät voivat lähettää vastauksia tarkistettavaksi!

source: You have already enrolled to this course.
fi: Olet aiemmin vastannut tähän tehtävään oikein.

source: Your enrollment has been automatically accepted.
fi: Ilmoittautumisesi on hyväksytty automaattisesti

source: Your enrollment application has been registered for approval.
fi: Ilmoittautumishakemuksesi on lähetetty hyväksyttäväksi

source: Only logged in users can manage their enrollments.
fi: Vain sisäänkirjautuneet käyttäjät voivat hallita ilmoittautumisiaan

source: You have not enrolled to this course.
fi: Et voi ilmoittautua tälle kurssille.

source: Your enrollment has been withdrawn
fi: Ilmoittautumisesi on peruttu

source: Only course staff members are allowed to download exercise files.
fi: Vain kurssien vastuuhenkilöt voivat ladata vastaustiedostot.

source: Only course staff members are allowed to download instance files.
fi: Vain kurssien vastuuhenkilöt voivat ladata vastaustiedostot.

source: Choose question to link
fi: Valitse liitettävä kysymys

source: Question
fi: Kysymys

source: Answer
fi: Vastaus

source: Unlink this question from this course instance
fi: Poista kysymys tästä kurssi-instanssista.

source: Edit this question or answer
fi: Muokkaa tätä kysymystä tai vastausta

source: Link an existing question to this exercise
fi: Liitä olemassaoleva kysymys tähän tehtävään

source: Link an existing question
fi: Liitä olemassaoleva kysymys

source: Add a new question
fi: Lisää uusi kysymys

source: Clear form
fi: Tyhjää lomake

source: Clear Form
fi: Tyhjää lomake

source: FAQ for this exercise was not found
fi: Tälle tehtävälle ei löytynyt UKK:ta

source: Cannot edit FAQ for frozen instance
fi: Jäädytetyn instanssin UKK:ta ei voi muokata

source: The question is not linked
fi: Kysymystä ei ole liitetty

source: Give feedback on this content
fi: Anna palautetta

source: Close feedback
fi: Piilota palautteet

source: Send feedback
fi: Lähetä palaute

source: You have already answered this feedback.
fi: Olet jo vastannut tähän palautekysymykseen.

source: Number of questions (max: {n})
fi: Kysymysten lukumäärä (max: {n})

source: -- GENERAL EXAM --
fi: -- YLEINEN TENTTI --

source: Confirm attempt deletion
fi: Vahvista tämän yrityksen poisto

source: Refresh exam to latest version
fi: Päivitä tentti uusimpaan versioon

source: Manage attempts
fi: Tenttiyritykset

source: Answered
fi: Vastattu

source: Unanswered
fi: Vastaamattomat

source: Uncertain
fi: Epävarmat

source: Questions
fi: Kysymykset

source: Mark certain/uncertain
fi: Merkitse varmaksi/epävarmaksi

source: Manage attempts for %(exam)s
fi: Hallinnoi tentin %(exam)s yrityksiä

source: Attempts
fi: Yritykset:

source: Manage Attempts for %(exam)s
fi: Hallinnoi tentin %(exam)s yrityksiä

source: Existing Attempts
fi: Olemassaolevat yritykset:

source: Open From
fi: Avautuu

source: Open To
fi: Sulkeutuu

source: Made For
fi: Tentin kohde

source: Answers
fi: Vastaukset

source: General Exam
fi: Generoi tentti

source: Preview attempt script
fi: Esikatsele tenttikysymykset

source: Configure this attempt
fi: Yrityksen asetukset

source: Delete this attempt
fi: Poista tämä yritys

source: Open a new attempt for this exam
fi: Avaa uusi yritys tälle tentille.

source: Start exam
fi: Aloita tentti

source: You don't have an open attempt for this exam.
fi: Tähän tenttiin ei ole aukiolevaa yritystä.

source: If an attempt is deleted, all existing answers will be lost. You can close the attempt by changing its end date if you want to retain existing answers while making the exam attempt unavailable.
fi: Jos yritys poistetaan, kaikki olemassaolevat vastaukset katoavat. Voit poiston sijaan sulkea tentin muuttamalla sen sulkeutumisaikaa, mikäli haluat sulkea tentin menettämättä siihen annettuja vastauksia.

source: Question retrieval failed. Contact teaching staff (reason: {e})
fi: Kysymyksen hakeminen epäonnistui. Ota yhteyttä henkilökuntaan (syy: {e})

source: Operation failed. Course staff has been notified.
fi: Opeaatio epäonnistui. Henkilökunnalle on lähetetty viesti.

source: No more questions available.
fi: Kysymyksiä ei ole jäljellä

source: Unable to find matching answer.
fi: Vastausta ei löytynyt

source: Invalid task type.
fi: Virheellinen tehtävätyyppi

source: You don't have an unanswered question for this exercise.
fi: Sinulla ei ole vastaamatonta kysymystä tähän tehtävään.

source: %(instance)s statistics
fi: %(instance)s tilastot

source: Statistics Console of %(instance)s
fi: Kurssin %(instance)s tilastot

source: Generate Stats
fi: Generoi tilastot

source: task
fi: tehtävä

source: answers
fi: vastauksia

source: tries
fi: yrityksiä

source: users
fi: vastaajia

source: done
fi: tehty

source: by DL
fi: ajallaan

source: late
fi: myöhässä

source: tries avg
fi: yritysten ka

source: tries med
fi: yritysten med

source: time avg
fi: aika ka

source: time med
fi: aika med

source: Last generated: {gen_timestamp}
fi: Viimeksi generoitu: {gen_timestamp}

source: Generation of new stats has been requested.
fi: Uusien tilastojen generointi on tilattu.

source: Stats have not been generated.
fi: Tilastoja ei ole generoitu.

source: Stats generation for '{instance}' has already been requested.
fi: Kurssitilan '{instance}' tilastojen generointi on jo tilattu.

source: Stats requested. Request processing starts approximately:
fi: Tilastot tilattu. Generointi alkaa arvioilta:

source: Number of matches to show
fi: Näytettävien osumien määrä

source: Upload base files
fi: Lataa pohjatiedostot

source: Choose which version(s) of the answers are analysed
fi: Valitse vertailtava(t) versio(t)

source: Latest version only (recommended)
fi: Vain viimeisin versio (suositus)

source: Include all versions (NOTE: they will match amongst themselves)
fi: Kaikki versiot (HUOM: tullaan vertaamaan myös toisiinsa)

source: Save settings for this exercise
fi: Tallenna asetukset tälle tehtävälle

source: Include answers from other instances
fi: Sisällytä vastaukset muista instansseista

source: Save template for this instance
fi: Tallenna pohja tälle kurssi-instanssille.

source: Grading mode
fi: Arvostelumoodi

source: Only grade latest answer
fi: Arvostele vain uusin vastaus

source: Grade all answers
fi: Arvostele kaikki vastaukset

source: Choose target instance
fi: Valitse kohdekurssitila

source: Programming language
fi: Ohjelmointikieli

source: username
fi: tunnus

source: last name
fi: sukunimi

source: first name
fi: etunimi

source: student id
fi: opisk.nro

source: points
fi: pisteet

source: missing
fi: puuttuvia

source: results url
fi: suorituslinkki

source: Sending failed. Try again to resume.
fi: Lähettäminen epäonnistui. Yritä uudestaan jatkaaksesi.

source: Completion statistics of %(instance)s
fi: Suoritustilastot kurssista %(instance)s

source: Given answers for %(content)s
fi: Tehtävän %(content)s vastaukset

source: Answers table
fi: Vastaustaulukko

source: Name
fi: Nimi

source: Completion statistics of %(instance)s
fi: Suoritustilastot kurssista %(instance)s

source: Scores and grades can be filled into the table using the link below
fi: Voit laskea pisteet ja arvosanat taulukkoon alla olevalla linkillä

source: Calculate grades
fi: Laske arvosanat

source: Number of students: %(students)s
fi: Opiskelijoiden lukumäärä: %(students)s

source: Results table
fi: Suoritustaulukko

source: Miss
fi: Puuttuu

source: Weighted Score
fi: Painotetut pisteet

source: Grade
fi: Arvosana

source: View student completion
fi: Opiskelijan suoritustiedot

source: %(username)s’s answers to %(exercise_name)s
fi: Käyttäjän %(username)s vastaukset tehtävään %(exercise_name)s

source: Previously generated report for this task
fi: Aiemmin generoitu raportti tälle tehtävälle

source: Submit request
fi: Lähetä pyyntö

source: %(instance)s enrollments
fi: %(instance)s ilmoittautumiset

source: %(name)s enrollments
fi: %(name)s ilmoittautumiset

source: accept
fi: hyväksy

source: deny
fi: evää

source: expel
fi: poista

source: selected users
fi: valitut käyttäjät

source: Submit
fi: Lähetä

source: Username
fi: Käyttäjätunnus

source: Status
fi: Tila

source: Controls
fi: Toiminnot

source: Send message to student
fi: Lähetä viesti opiskelijalle

source: Transfer records to another instance
fi: Siirrä suoritukset toiseen kurssitilaan

source: Expel student
fi: Poista opiskelija

source: Accept enrollment
fi: Hyväksy ilmoittautuminen

source: Deny enrollment
fi: Evää ilmoittautuminen

source: Manage Reminders for %(instance)s
fi: Kurssin %(instance)s muistutukset

source: This utility can be used to remind students about late assignments
fi: Tällä työkalulla voit lähettää muistutuksia opiskelijoille myöhästyneistä tehtävistä

source: Generate reminders
fi: Generoi muistutukset

source: load
fi: lataa

source: discard
fi: hylkää

source: Reminders will be sent to the following students
fi: Muistutukset lähetetään seuraaville käyttäjille

source: Send email
fi: Lähetä sähköposti

source: Reset completion for %(content)s
fi: Nollaa tehtävän %(content)s suoritukset

source: %(name)s's completion of %(instance)s
fi: %(name)s suoritukset kurssista %(instance)s

source: Completion
fi: Suoritukset

source: %(name)s's completion of %(instance)s
fi: %(name)s suoritukset kurssista %(instance)s

source: <div class="paragraph">Total missing: %(missing)s</div> <div class="paragraph">Total score: %(points)s / %(available)s</div>
fi: <div class="paragraph">Puuttuvat yhteensä: %(missing)s</div> <div class="paragraph">Pisteet yhteensä: %(points)s / %(available)s</div>

source: Page results
fi: Suoritukset sivuittain

source: <li class="results-page-bullet tasks-collapsed" onclick="expand_task_list(this)">%(name)s (Done: %(done)s/%(tasks)s | Points: %(points)s/%(available)s | Score: %(score)s)</li>
fi: <li class="results-page-bullet tasks-collapsed" onclick="expand_task_list(this)">%(name)s (Tehty: %(done)s/%(tasks)s | Pisteet: %(points)s/%(available)s | Painotettu: %(score)s)</li>

source: Completion in other instances
fi: Suoritukset muissa instansseissa

source: Only course main responsible teachers are allowed to download answer files.
fi: Vain kurssien vastuuhenkilöt voivat ladata vastaustiedostot.

source: Only course main responsible teachers are allowed to manage enrollments.
fi: Vain kurssien vastuuhenkilöt voivat ladata vastaustiedostot.

source: Enrollment for the student does not exist.
fi: Tämä opiskelija ei ole ilmoittautunut

source: Enrollment status of {username} changed to {action}
fi: Opiskelijan {username} ilmoittautumisen tilaksi muutettu: {action}

source: Set enrollment state to {action} for the following users.
fi: Asetettiin ilmoittautumisen tilaksi {action} seuraaville käyttäjille

source: The operation was not applicable for these users.
fi: Operaatiota ei voitu suorittaa näille käyttäjille

source: Transfer records of {user} from {instance}
fi: Siirrä käyttäjän {user} suoritukset kurssitilasta {instance}

source: Completion CSV generation (task id: {}) has already been downloaded.
fi: CSV-suoritustiedot (task id: {}) on jo ladattu.

source: Send emails
fi: Lähetä sähköpostit

source: Unable to retrieve cached reminders.
fi: Tallennettujen muistutusten haku epäonnistui

source: Task is not linked to this course
fi: Tehtävää ei ole liitetty kurssitilaan.

source: Perform batch grading for {content}
fi: Suorita massa-arvostelu tehtävälle {content}

source: Completion reset is not supported for this task type
fi: Suoritusten nollausta ei voi tehdä tälle tehtävätyypille

source: Completion reset is not possible for manually evaluated tasks
fi: Suoritusten nollausta ei voi tehdä käsin arvosteltaville tehtäville

source: Menu:
fi: Valikko:

source: Signup
fi: Luo käyttäjä

source: Sign Up for Lovelace account
fi: Luo erillinen Lovelace-tunnus

source: Already have an account? Then please <a href="%(login_url)s">sign in</a>.
fi: Jos sinulla on jo tunnus <a href="%(login_url)s">kirjaudu sisään</a>.

source: Sign Up
fi: Luo käyttäjä

source: This view is limited to course staff.
fi: Tämä näkymä on rajattu kurssin henkilökunnalle.

source: This view is limited to main responsible teacher.
fi: Tämä näkymä on rajattu kurssin vastuuopettajalle.

source: You must be enrolled to perform this action.
fi: Vain ilmoittautuneet käyttäjät voivat suorittaa tämän toiminnon.

source: This view is limited to content owners and staff
fi: Tämä näkymä on rajattu omistajalle ja henkilökunnalle

source: This view is limited to group supervisor
fi: Tämä näkymä on rajattu ryhmän ohjaajalle.
