Repository: lovelace-dev-org/lovelace
Catalog: webapp/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Either title in default language, or existing sheet must be filled
fi: Otsikko-kenttä oletuskielellä tai olemassa olevan lomakkeen valinta vaaditaan.

source: Default sheet title ({lang}):
fi: Lomakkeen oletusotsikko ({lang}):

source: Alternative sheet title ({lang}):
fi: Vaihtoehtoinen otsikko ({lang}):

source: Choose sheet to use
fi: Valitse käytettävä lomake

source: ----NEW--SHEET----
fi: ---UUSI--LOMAKE---

source: Make a copy of selected sheet
fi: Tee kopio valitusta taulukosta

source: required
fi: vaadittu

source: Mark this assessment as correct
fi: Merkitse arvostelu hyväksytyksi

source: This assessment is complete
fi: Merkitse arvostelu valmiiksi

source: Courses
fi: Kurssit

source: Submissions
fi: Lähetetyt vastaukset

source: %(username)s’s assessment for %(exercise_name)s
fi: Arvostelu käyttäjän %(username)s vastauksesta tehtävään %(exercise_name)s

source: %(title)s of %(username)s's answer to %(exercise_name)s
fi: %(title)s käyttäjän %(username)s vastauksesta tehtävään %(exercise_name)s

source: Save
fi: Tallenna

source: Add or change assessment sheet
fi: Lisää uusi lomake tai vaihda lomaketta

source: Writes the assessment total point value as the exercise point value
fi: Päivittää tehtävän maksimipistemäärän vastaamaan arvostelulomaketta

source: Update exercise points
fi: Päivitä tehtävän pisteet

source: Add a new assessment bullet to this section
fi: Lisää uusi arvostelukohde tähän osioon

source: Remove this assessment section
fi: Poista tämä arvosteluosio

source: Rename this assessment section
fi: Uudellennimeä arvosteluosio

source: Add a new assessment bullet after this bullet
fi: Lisää uusi arvostelukohde tämän perään

source: Remove this assessment bullet
fi: Poista tämä arvostelukohde

source: Edit this assessment bullet
fi: Muokkaa tätä arvostelukohdetta

source: Move bullet by dragging this button
fi: Liikuta arvostelukohdetta raahaamalla tätä nappia

source: Add a new assessment section
fi: Lisää uusi arvosteluosio

source: Submissions for %(exercise)s
fi: Lähetetyt vastaukset tehtävään %(exercise)s

source: Submissions for %(exercise)s
fi: Lähetetyt vastaukset tehtävään %(exercise)s

source: Unassessed Submissions
fi: Arvostelemattomat vastaukset

source: Group
fi: Ryhmä

source: Student(s)
fi: Opiskelija(t)

source: Answer Link
fi: Vastauslinkki

source: Assessment Link
fi: Arvostelulinkki

source: Points
fi: Pisteet

source: view answers
fi: katso vastaukset

source: assess
fi: arvostele

source: Assessed Submissions
fi: Arvostellut vastaukset

source: view assessment
fi: katso arvostelu

source: Add a new or existing assessment sheet to be used for this exercise.
fi: Liitä uusi tai olemassa oleva arvostelulomake tähän tehtävään.

source: Assessment sheet for this exercise doesn't exist
fi: Tällä tehtävällä ei ole valittua arvostelulomaketta

source: This exercise does not have manual assessment.
fi: Tehtävä ei ole käsin arvioitava.

source: This answer has not been evaluated
fi: Tätä vastausta ei ole arvosteltu.

source: Assessment not found
fi: Arvostelua ei löytynyt

source: Send message to all reservers
fi: Lähetä viesti kaikille varaajille

source: This event is already full.
fi: Tapahtuma on jo täynnä.

source: You have already reserved a slot in this event.
fi: Olet jo varannut paikan tähän tapahtumaan.

source: Slot reserved!
fi: Paikka varattu!

source: Reservation cancelled.
fi: Varaus peruttu.

source: Reservation already cancelled.
fi: Varaus on jo peruttu.

source: Delete block
fi: Poista lohko

source: Name for new object
fi: Nimi uudelle objektille

source: Choose existing object
fi: Valitse olemassaoleva objekti

source: Code block content
fi: Koodiblokin sisältö

source: Heading text
fi: Otsikkoteksti

source: List markup
fi: Lista

source: Paragraph markup
fi: Tekstikappale

source: SVG markup
fi: Vektorigrafiikka

source: Table markup
fi: Taulukko

source: KaTeX markup
fi: KaTeX-lohko

source: This field or name and fileinfo must be filled
fi: Joko tämä kenttä, tai nimi sekä tiedosto pitää täyttää

source: This field cannot be empty for new files
fi: Tämä kenttä ei voi olla tyhjä uusille tiedostoille

source: Choose existing include
fi: Valitse olemassaoleva liitettäväksi

source: ----NOT--SELECTED----
fi: ---EI---VALITTU---

source: Include type
fi: Liitettävä tyyppi

source: DOM location
fi: Sijoituspaikka

source: Unlink
fi: Poista

source: Existing file must be chosen, or both fileinfo and name must be filled to create a new file
fi: Valitse olemassaoleva tiedosto, tai lataa tiedosto ja täytä nimi-kenttä luodaksesi uuden tiedoston

source: Included files
fi: Liitetyt tiedostot

source: iframe width
fi: iframen leveys

source: iframe height
fi: iframen korkeus

source: Border CSS
fi: Reunan tyyli (CSS)

source: Choose existing script
fi: Valitse olemassaoleva skripti

source: No content preview
fi: Älä näytä sisältöä

source: Placement
fi: Sijoitus

source: Before highlighted content block
fi: Valitun blokin yläpuolelle

source: After highlighted content block
fi: Valitun blokin alapuolelle

source: Mode (if applicable)
fi: Toiminto (jos sovellettavissa)

source: Create a new object
fi: Luo uusi objekti

source: Include an existing object
fi: Liitä olemassaoleva objekti

source: Block type to add
fi: Lisättävän blokin tyyppi

source: Base word
fi: Sanan perusmuoto

source: Inflections (comma sep.)
fi: Taivutukset (pilkulla erotettuna)

source: Replace in
fi: Korvaa valituissa

source: Term
fi: Termi

source: Name causes slug conflict
fi: Nimestä aiheutuu tunnistekonflikti

source: Choose frontpage
fi: Valitse etusivu

source: --NO-FRONTPAGE--
fi: --EI--ETUSIVUA--

source: Freeze instance contents to date:
fi: Jäädytä instanssin sisältö päivämäärään:

source: Instance default name ({lang})
fi: Instanssin oletusnimi ({lang})

source: Alternative name ({lang})
fi: Vaihtoehtoinen nimi ({lang})

source: Value contains invalid placeholders
fi: Arvossa on virheellisiä paikanpitimiä

source: Value is not a valid Python expression
fi: Arvo ei ole kelvollinen Python-lauseke

source: Does not result in a number when evaluated
fi: Lausekkeen lopputulos ei ole numero

source: The formula results must be between 0 and 1
fi: Kaavan tuloksen tulee olla välillä 0-1

source: Choose content to link
fi: Valitse liitettävä sisältösivu

source: ----NEW--PAGE----
fi: ----UUSI-SIVU----

source: Make this node a child of the selected node
fi: Lisää valitun sivun alasivuksi

source: Name for new page (in default language)
fi: Nimi uudelle sivulle (oletuskielellä)

source: Choose student to add
fi: Valitse lisättävä opiskelija

source: -- no supervisor --
fi: --- ei ohjaajaa ---

source: Cannot invite this user
fi: Käyttäjää ei voitu kutsua.

source: Invitee {}
fi: Kutsuttu {}

source: -- no content --
fi: -- ei sisältöä--

source: Starting date and time
fi: Aloituspäivämäärä ja aika

source: Duration of each event (minutes)
fi: Yhden tapahtuman kesto (min)

source: Number of slots per event
fi: Varausten määrä tapahtumaa kohden

source: Number of events to add
fi: Lisättävien tapahtumien määrä

source: Default name ({lang}):
fi: Oletusnimi ({lang}):

source: Alternative name ({lang}):
fi: Vaihtoehtoinen nimi ({lang}):

source: Cannot save without a name
fi: Tallennus vaatii nimen

source: Can't overwrite a saved message unless it was loaded
fi: Voit päällekirjoittaa viestin vain jos latasit sen

source: Save this message
fi: Tallenna viesti

source: Load message
fi: Lataa viesti

source: -- no message --
fi: --- ei viestiä ---

source: Regenerate archived content. This can break old course instances.
fi: Generoi myös arkistoidulle sisällölle. Saattaa rikkoa vanhat kurssitilat.

source: Send
fi: Lähetä

source: Send a message to {user}
fi: Lähetä viesti käyttäjälle {user}

source: User is not enrolled to this course instance
fi: Käyttäjä ei ole ilmoittautunut tähän kurssitilaan

source: Send message to all enrolled users
fi: Lähetä viesti kaikille ilmoittautuneille

source: Remote authentication did not provide an email address. The most likely cause is a delay between systems. Please wait a few hours and try again.
fi: Tunnistautumisjärjestelmä ei antanut sähköpostiosoitetta. Todennäköisesti tämä johtuu viiveestä järjestelmien välillä. Odota pari tuntia ja kokeile uudestaan

source: Group name
fi: Ryhmän nimi

source: Write a mathematical formula. Four placeholders are available.\n{q} is obtained score as quotient of max points.\n{p} is obtained raw points\n{m} is the task's max points\n{d} is the amount of days since deadline
fi: Kirjoita matemaattinen kaava. Neljä paikanpidintä ovat käytettävissä.\n {q} on saadut pisteet jaettuna maksimilla.\n{p} on saatujen pisteiden määrä\n{m} on tehtävän maksimipistemäärä\n{d} on palautuspäivästä kuluneiden päivien lukumäärä

source: Filename {} is not listed in accepted filenames. Allowed: {}
fi: Tiedoston nimi {} ei kuulu sallittujen nimien joukkoon. Sallittuja ovat: {}

source: Task improperly configured, notify staff!
fi: Tehtävä on virheellisesti konfiguroitu, ilmoita henkilökunnalle

source: Filename to use for the answer
fi: Tallenna vastaus nimellä

source: Required for tasks where answer mode is TEXT. For FILE, submitted file is renamed to this name unless multiple files are returned. For multiple files this does nothing.
fi: Vaaditaan tehtävillä joiden vastaus annetaan tekstinä. Jos tehtävään vastataan tiedostolla, palautettu tiedosto uudelleennimetään annettuun nimeen, paitsi jos palautettiin useita tiedostoja, jolloin tällä kentällä ei ole vaikutusta.

source: Freeze this instance to reflect its state at the given date. This operation is not intended to be reversible.
fi: Jäädytä kurssitilan sisältö näyttämään annettuna päivämääränä käytössä olleetversiot. Tätä operaatiota ei ole suunniteltu peruutettavaksi.

source: Make a clone of this course instance.
fi: Tee klooni tästä kurssi-instanssista.

source: Regenerate cache for all pages in the course. Please use sparingly.
fi: Päivitä välimuisti kaikille kurssin sivuille. Käytä säästeliäästi.

source: Execute
fi: Suorita

source: Regenerate cache for {content}
fi: Uudelleenmuodosta välimuisti sisällölle {content}

source: This content node doesn't exist
fi: Sisältösilmua ei ole olemassa

source: Cannot move a node to itself
fi: Sivua ei voi siirtää itseensä

source: Cannot move a node inside its own branch
fi: Sivua ei voi siirtää omien alasivujensa joukkoon

source: Cannot edit content through archived pages
fi: Sisällön muokkausta ei voi tehdä arkistoidulta sivulta

source: Get form
fi: Hae lomake

source: Only staff members can access this view
fi: Vain henkilökunta pääsee tähän näkymään

source: No content to show
fi: Ei näytettävää sisältöä

source: No running Celery workers were found.
fi: Tarkistimia ei ole käynnissä.

source: %(username)s’s answers to %(exercise_title)s
fi: Käyttäjän %(username)s vastaukset tehtävään %(exercise_title)s

source: %(username)s’s answers to %(exercise.name)s
fi: Käyttäjän %(username)s vastaukset tehtävään %(exercise.name)s

source: Your answers to %(exercise_title)s
fi: Vastauksesi tehtävään %(exercise_title)s

source: %(answercount)s entered answer for this exercise
fi: %(answercount)s syötetty vastaus tähän tehtävään

source: Add new
fi: Lisää uusi

source: This site uses cookies. Only cookies that are necessary for the site to work or to remember your settings (like language) are used. This site does not use any tracking cookies. Learn more about our <a href="%(terms_url)s">terms and conditions</a>.
fi: Tämä sivusto käyttää evästeitä. Sivusto käyttää ainoastaan evästeitä, jotka ovat välttämättömiä sen toiminnan kannalta, tai joita tarvitaan käyttäjän asetusten (kuten kieli) muistamiseen. Sivusto ei käytä seurantaevästeitä.Lue lisää <a href="%(terms_url)s">käyttöehdoista</a>.

source: Accept
fi: Hyväksy

source: Settings
fi: Asetukset

source: Group info
fi: Ryhmän tiedot

source: Management panel
fi: Hallintapaneeli

source: Manage enrollments
fi: Kurssi-ilmoittautumiset

source: Manage groups
fi: Ryhmien hallinta

source: Open the mass email panel
fi: Avaa Massasähköpostipaneeli

source: Mass email
fi: Massasähköposti

source: Course completion
fi: Suoritustilastot

source: Reminders
fi: Muistutukset

source: Statistics
fi: Tilastot

source: Log out
fi: Kirjaudu ulos

source: Log in
fi: Kirjaudu sisään

source: Sign up
fi: Luo käyttäjä

source: Table of Contents
fi: Sisällysluettelo

source: Toggle between student and staff view
fi: Vaihda henkilökunnan ja opiskelijan näkymän välillä

source: staff view
fi: opettajatila

source: Hide/Show the termbank
fi: Piilota/Näytä termipankki

source: Termbank
fi: Termipankki

source: Search for a term…
fi: Hae termiä…

source: Hide/Show the table of contents
fi: Piilota/Näytä sisällysluettelo

source: Completed:
fi: Ratkaistu:

source: exercises
fi: tehtävää

source: Close the panel
fi: Sulje paneeli

source: Description
fi: Kuvaus

source: Terms and Conditions
fi: Käyttöehdot

source: Reserve a slot
fi: Varaa aika

source: Calendar settings
fi: Kalenterin asetukset

source: Add calendar events
fi: Lisää kalenteritapahtumia

source: Reduce slots
fi: Vähennä paikkoja

source: Increase slots
fi: Lisää paikkoja

source: Reserver
fi: Varaaja

source: View answers
fi: Katso vastaukset

source: Send message to reserver
fi: Lähetä viesti varaajalle

source: No reservations.
fi: Ei varauksia

source: You have been reserved a slot in
fi: Olet varannut paikan tähän tapahtumaan.

source: Cancel reservation
fi: Peru varaus

source: Line %(line)s in %(file)s
fi: Rivi %(line)s tiedostossa %(file)s

source: You haven’t answered this exercise yet
fi: Et ole vielä vastannut tähän tehtävään.

source: You have answered this exercise incorrectly
fi: Olet aiemmin vastannut tähän tehtävään väärin.

source: You have answered this exercise correctly
fi: Olet aiemmin vastannut tähän tehtävään oikein.

source: You have answered another exercise in this set correctly
fi: Olet aiemmin vastannut vaihtoehtoiseen tehtävään oikein.

source: View your previous answers
fi: Katso edellisiä vastauksiasi

source: <span class="answer-count">%(counter)s</span> answer
fi: <span class="answer-count">%(counter)s</span> vastaus

source: Teacher’s tools
fi: Opettajan työkalut

source: Feedback
fi: Palautteet

source: Open cache regen panel
fi: Avaa välimuistin päivityspaneeli

source: Regenerate cache
fi: Päivitä välimuisti

source: Download answers
fi: Lataa vastaukset

source: Check plagiarism
fi: Plagiarismitarkistus

source: Edit this lecture
fi: Muokkaa tätä luentosivua

source: Edit this textfield exercise
fi: Muokkaa tätä tekstikenttätehtävää

source: Edit this multiple choice exercise
fi: Muokkaa tätä monivalintatehtävää

source: Edit this checkbox exercise
fi: Muokkaa tätä valintaruututehtävää

source: Edit this file upload exericse
fi: Muokkaa tätä tiedoston lähetys -tehtävää

source: Edit this code input exercise
fi: Muokkaa tätä koodinsyöttötehtävää

source: Edit this code replace exercise
fi: Muokkaa tätä koodinkorvaustehtävää

source: Edit this repeated template exercise
fi: Muokkaa tätä mallinkertaustehtävää

source: Edit this routine exercise
fi: Muokkaa tätä rutiinitehtävää

source: Course statistics
fi: Kurssin tilastot

source: Course instance settings
fi: Kurssi-instanssin asetukset

source: Freeze this course instance
fi: Jäädytä tämä kurssi-instanssi.

source: Make a clone of this course instance
fi: Kloonaa tämä kurssi-instanssi.

source: Edit course grading for this instance
fi: Muokkaa kurssin arvostelua tässä kurssitilassa.

source: Regenerate cache for this instance
fi: Päivitä tämän kurssitilan välimuisti.

source: Termify words in this instance
fi: Muuta sanoja termeiksi tässä kurssitilassa.

source: Course Contents
fi: Kurssin sisältö

source: Add a new content at the beginning
fi: Lisää uutta sisältöä alkuun

source: Add a new content node after or inside this node
fi: Lisää uusi sivu tämän sivun jälkeen tai alasivuksi

source: Remove this node from the course instance
fi: Poista sivu tästä kurssitilasta.

source: Edit node settings
fi: Muuta sivun asetuksia

source: Move node by dragging this button
fi: Siirrä sivua raahaamalla tätä nappia

source: Completed
fi: Ratkaistu

source: Send answer
fi: Lähetä vastaus

source: Your submitted answer is waiting for staff assessment
fi: Lähetetty vastauksesi odottaa arvostelua

source: <span class="answer-count">%(counter)s</span> answer
fi: <span class="answer-count">%(counter)s</span> vastaus

source: Open the FAQ panel
fi: Avaa UKK-paneeli

source: Frequently Asked Questions
fi: Usein kysyttyä

source: View assessment sheet
fi: Katso arvosteluperusteet

source: Assessment Criteria
fi: Arvosteluperusteet

source: Answer summary
fi: Vastaustaulukko

source: Open the batch grading panel
fi: Avaa massa-arvostelupaneeli

source: Batch grading
fi: Massa-arvostelu

source: Edit this exercise
fi: Muokkaa tehtävää

source: View Submissions
fi: Katso arvosteltavat

source: Open the assessment edit panel
fi: Avaa arvostelun muokkauspaneeli

source: Edit Assessment
fi: Muokkaa arvostelua

source: Hints
fi: Vihjeet

source: Attempts:
fi: Yritykset:

source: Warning: You have not logged in. You cannot answer.
fi: Varoitus: Et ole kirjautunut sisään. Et voi vastata.

source: Warning: You have not enrolled to this course instance. You cannot answer.
fi: Varoitus: Et ole ilmoittautunut tälle kurssille. Et voi vastata.

source: You have previously answered this task incorrectly.
fi: Olet aiemmin vastannut tähän tehtävään väärin.

source: You have already answered this task correctly.
fi: Olet aiemmin vastannut tähän tehtävään oikein.

source: Messages
fi: Viestit

source: <span class="answer-count">%(counter)s</span> answer
fi: <span class="answer-count">%(counter)s</span> vastaus

source: Your answer has been recorded and is currently pending an evaluation by a teacher.
fi: Vastauksesi on tallennettu ja odottaa opettajan arviointia.

source: Correct answer!
fi: Oikea vastaus!

source: Incorrect answer!
fi: Väärä vastaus!

source: Copy the link to your answer to the clipboard
fi: Kopioi linkki vastaukseesi leikepöydälle

source: Link copied!
fi: Linkki kopioitu!

source: Correct
fi: Oikein

source: Incorrect
fi: Väärin

source: Collaborators:
fi: Yhteistyökumppanit:

source: Who did you co-operate with?
fi: Kenen kanssa työskentelit?

source: Allowed filenames:
fi: Sallitut tiedostojen nimet

source: Submit your files here:
fi: Syötä tiedostosi tänne:

source: Enter your code here
fi: Syötä vastauksesi tähän

source: group info
fi: ryhmän tiedot

source: Show group settings
fi: Näytä ryhmän asetukset

source: Group Members
fi: Ryhmän jäsenet

source: Last Name
fi: Sukunimi

source: First Name
fi: Etunimi

source: Email
fi: Sähköposti

source: Member invitations
fi: Jäsenkutsut

source: Cancel this invitation
fi: Peru kutsu

source: Invite members
fi: Kutsu jäseniä

source: Join a group you have been invited to
fi: Liity ryhmään johon sinut on kutsuttu

source: Group Name
fi: Ryhmän nimi

source: Invited by
fi: Kutsuja

source: Accept this invitation
fi: Hyväksy tämä kutsu

source: Create a new group
fi: Luo uusi ryhmä

source: Group Management
fi: Ryhmien hallinta

source: Number of groups: %(groups)s
fi: Ryhmien lukumäärä %(group)s

source: supervisor:
fi: ohjaaja:

source: Rename this group
fi: Muuta ryhmän nimi

source: Add a member to this group
fi: Lisää jäsen tähän ryhmään

source: Remove this group
fi: Poista tämä ryhmä

source: Remove this member
fi: Poista tämä jäsen

source: Available courses
fi: Tarjolla olevat kurssit

source: credits
fi: op

source: No courses available!
fi: Tarjolla olevia kursseja ei löytynyt!

source: Login
fi: Kirjautuminen

source: Sign in with university account
fi: Kirjaudu sisään yliopiston tunnuksilla

source: To login page
fi: Kirjautumissivulle

source: Sign in with Lovelace account
fi: Kirjaudu sisään Lovelace-tunnuksella

source: Show login form
fi: Näytä kirjautumislomake

source: If you have not created an account yet, then please <a href="%(signup_url)s">sign up</a> first.
fi: Jos et ole vielä luonut tunnusta <a href="%(signup_url)s">luo tunnus</a> ensin.

source: Forgot Password?
fi: Unohtunut salasana?

source: Sign In
fi: Kirjaudu sisään

source: Logout
fi: Uloskirjautuminen

source: Sign Out
fi: Kirjaudu ulos

source: Are you sure you want to sign out?
fi: Haluatko varmasti kirjautua ulos

source: %(instance)s reminders
fi: %(instance)s muistutukset

source: Send mass email to %(instance)s students
fi: Lähetä massaviesti kurssitilan %(instance)s opiskelijoille

source: This utility can be used to send mass email to all students
fi: Tällä työkalulla voit lähettää sähköpostin kaikille opiskelijoille

source: Start exercise session
fi: Aloita harjoitusistunto

source: Next
fi: Seuraava

source: Start over
fi: Aloita alusta

source: Enter your answer here
fi: Kirjoita vastauksesi tänne

source: Terms and conditions
fi: Käyttöehdot

source: Cookies
fi: Evästeet

source: This site uses cookies to store user information such as whether the user has logged in or not. Cookies are also used for protecting the user from a certain type of attack called cross site request forgery.
fi: Tämä sivusto käyttää evästeitä käyttäjätietojen (esimerkiksi sen, onko käyttäjä kirjautunut sisään vai ei) tallentamiseen. Evästeitä käytetään myös käyttäjän tietojen suojaamiseksi tietynlaiselta hyökkäykseltä, jota kutsutaan nimellä Cross Site Request Forgery.

source: Registration Document
fi: Rekisteriseloste

source: You can request a registration document by e-mail from address E-MAIL. It may take us 14 working days to reply.
fi: Voit pyytää rekisteriselostetta sähköpostitse osoitteesta E-MAIL. Vastaamiseen voi kestää 14 arkipäivää.

source: %(username)s’s answers to %(exercise_title)s
fi: Käyttäjän %(username)s vastaukset tehtävään %(exercise_title)s

source: Answer date
fi: Vastauksen päivämäärä

source: Entered answer
fi: Syötetty vastaus

source: Evaluation
fi: Arviointi

source: Unknown
fi: Tuntematon

source: Highlight this answer (shareable link)
fi: Korosta tämä vastaus (jaettava linkki)

source: Send course staff a question about this answer
fi: Lähetä kurssin henkilökunnalle kysymys tästä vastauksesta

source: View assessment
fi: Katso arvostelu

source: View checker log
fi: Katso tarkistustulokset

source: Assess submission
fi: Arvostele vastaus

source: Answers in other instances
fi: Vastaukset muissa instansseissa

source: Triggers fired
fi: Aktivoidut tapahtumat

source: Preview
fi: Esikatselu

source: You are not enrolled.
fi: Et ole ilmoittautunut.

source: Enroll
fi: Ilmoittaudu

source: Enrollment period for this course instance has closed.
fi: Ilmoittautumisaika tälle kurssille on sulkeutunut

source: Log in to enable enrolling.
fi: Kirjaudu sisään ilmoittautuaksesi.

source: You have enrolled
fi: Olet ilmoittautunut.

source: Your application was not accepted
fi: Osallistumispyyntöäsi ei hyväksytty.

source: You have been removed from this course instance
fi: Sinut on poistettu tältä kurssilta.

source: Your enrollment is waiting confirmation
fi: Osallistumispyyntösi odottaa käsittelyä.

source: Your enrollment has been transfered to another instance
fi: Ilmoittautumisesi on siirretty toiseen kurssitilaan

source: You have withdrawn your enrollment
fi: Olet peruuttanut ilmoittautumisesi.

source: Withdraw
fi: Peruuta

source: Re-Enroll
fi: Ilmoittaudu uudestaan

source: Enroll to
fi: Ilmoittaudu

source: Enrollments to this course must be accepted by the teacher
fi: Tälle kurssille osallistuminen vaatii opettajan hyväksynnän

source: You can attach a note to your enrollment application by typing below
fi: Voit liittää osallistumispyyntöön viestin kirjoittamalla alla olevaan laatikkoon

source: Type your application here
fi: Kirjoita hakemuksesi tähän
